/*
 * Дан массив из целых чисел
 *
 * 2. создай указатель pCurrent (current - текущий) и помести в него ссылку на нулевой элемент массива
 * 3. создай указатель pLast и помести в него ссылку на последний элемент массива
 * 4. напиши цикл while, условием в котором будет следующее:
 *    адрес текущего указателя меньше или равен адресу последнего элемента
 * 5. в теле цикла:
 *    выводи переменную, лежащую в текущем указателе
 *    увеличивай адрес текущего указателя (переходи на следующий элемент)
 */

#include <iostream>
using namespace std;

int main () {
    int array[5] = {1, 4, 2, 5, 3};
    // твой код здесь

    return 0;
}
