/*
 * Петя любит кататься на трамваях и очень радуется,
 * когда ему попадается счастливый билет.
 * К сожалению, Петя очень не любит считать,
 * поэтому тебе придется написать для него функцию,
 * которая определяет, является ли билет счастливым.
 *
 * Входные параметры функции:
 *      целое шестизначное число (номер билета)
 * Результат:
 *      1 - если билет счасливый
 *      0 - если нет
 *
 * Билет считается счастливым, если сумма первых 3 цифр равняется
 * сумме последних трех цифр.
 *
 * Пример:
 * 123321 - счасливый
 * 123456 - несчасливый
 *
 * Название для функции придумай сам
 * Функцию желательно протестировать с помощью assert()
 *
 * Напоминаю:
 *  % остаток от деления
 *      5 % 3 == 2
 *  / целочисленное деление (если оба числа целые)
 *      5 / 3 == 1
 */

#include <iostream>
#include <assert.h>
using namespace std;

// здесь будет твоя функция

int main() {
    // здесь будут тесты

    return 0;
}
