/*
 * Необходимо написать функцию, которая принимает целое число,
 * состоящее только из 0 и 1 (например 10011010)
 * нужно вернуть количество единичек в этом числе.
 * Обрати внимание, что число может быть любой длины.
 *
 * Пример работы функции:
 *
 * Входное значение:
 * 1
 * Результат:
 * 1
 *
 * Входное значение:
 * 101
 * Результат:
 * 2
 *
 * Входное значение:
 * 11101011
 * Результат:
 * 6
 */

#include <iostream>
#include <assert.h>
using namespace std;

// здесь будет твоя функция

int main() {
    // здесь будут тесты

    return 0;
}
